app/Services/Acl/AuthService.php

SELECT *
FROM `acl_usuarios`
WHERE `username` = 'admin'
AND `activo` = 1
 LIMIT 1
---
    public function attemptLogin(string $username, string $password): bool
    {
        $user = $this->usuarioModel->where('username', $username)
            ->where('activo', 1)
            ->first();