app/Models/Acl/UsuarioModel.php

SELECT DISTINCT `m`.`id`, `m`.`path`, `m`.`nombre`, `m`.`descripcion`, `m`.`icono`, `m`.`orden`
FROM `acl_modulos` as `m`
INNER JOIN `acl_permisos_modulos` as `pm` ON `pm`.`modulo_id` = `m`.`id`
INNER JOIN `acl_roles_permisos` as `rp` ON `rp`.`permiso_id` = `pm`.`permiso_id`
INNER JOIN `acl_usuarios_roles` as `ur` ON `ur`.`rol_id` = `rp`.`rol_id`
WHERE `ur`.`usuario_id` = 1
AND `m`.`activo` = 1
ORDER BY `m`.`orden`
---
    public function getModulosPermitidos(int $userId): array
    {
        return $this->db->table('acl_modulos as m')
            ->select('m.id, m.path, m.nombre, m.descripcion, m.icono, m.orden')
            ->distinct()
            ->join('acl_permisos_modulos as pm', 'pm.modulo_id = m.id', 'inner')
            ->join('acl_roles_permisos as rp', 'rp.permiso_id = pm.permiso_id', 'inner')
            ->join('acl_usuarios_roles as ur', 'ur.rol_id = rp.rol_id', 'inner')
            ->where('ur.usuario_id', $userId)
            ->where('m.activo', 1)
            ->orderBy('m.orden')
            ->get()
            ->getResultArray();

SELECT `p`.`nombre` as `permiso`
FROM `acl_roles_permisos` as `rp`
INNER JOIN `acl_permisos` as `p` ON `p`.`id` = `rp`.`permiso_id`
INNER JOIN `acl_usuarios_roles` as `ur` ON `ur`.`rol_id` = `rp`.`rol_id`
INNER JOIN `acl_permisos_modulos` as `pm` ON `pm`.`permiso_id` = `rp`.`permiso_id`
WHERE `ur`.`usuario_id` = 1
AND `pm`.`modulo_id` = 1
---
    public function getPermisosModulo(int $userId, int $moduloId): array
    {
        return $this->db->table('acl_roles_permisos as rp')
            ->select('p.nombre as permiso')
            ->join('acl_permisos as p', 'p.id = rp.permiso_id', 'inner')
            ->join('acl_usuarios_roles as ur', 'ur.rol_id = rp.rol_id', 'inner')
            ->join('acl_permisos_modulos as pm', 'pm.permiso_id = rp.permiso_id', 'inner')
            ->where('ur.usuario_id', $userId)
            ->where('pm.modulo_id', $moduloId)
            ->get()
            ->getResultArray();

SELECT `r`.`nombre`
FROM `acl_roles` as `r`
INNER JOIN `acl_usuarios_roles` as `ur` ON `ur`.`rol_id` = `r`.`id`
WHERE `ur`.`usuario_id` = 1
---
    public function getRolesPorUsuario(int $userId): array
    {
        return $this->db->table('acl_roles as r')
            ->select('r.nombre')
            ->join('acl_usuarios_roles as ur', 'ur.rol_id = r.id', 'inner')
            ->where('ur.usuario_id', $userId)
            ->get()
            ->getResultArray();

SELECT `p`.`nombre`
FROM `acl_permisos` as `p`
INNER JOIN `acl_roles_permisos` as `rp` ON `rp`.`permiso_id` = `p`.`id`
INNER JOIN `acl_usuarios_roles` as `ur` ON `ur`.`rol_id` = `rp`.`rol_id`
WHERE `ur`.`usuario_id` = 1
---
    public function getPermisosPorUsuario(int $userId): array
    {
        return $this->db->table('acl_permisos as p')
            ->select('p.nombre')
            ->join('acl_roles_permisos as rp', 'rp.permiso_id = p.id', 'inner')
            ->join('acl_usuarios_roles as ur', 'ur.rol_id = rp.rol_id', 'inner')
            ->where('ur.usuario_id', $userId)
            ->get()
            ->getResultArray();