app/Controllers/Acl/AclBaseController.php

    private function loadModuleDetails()
    {
        if ($this->moduloId) {
            $moduloModel = new ModuloModel();
            $modulo = $moduloModel->find($this->moduloId);
---
SELECT *
FROM `acl_modulos`
WHERE `acl_modulos`.`id` = 1